_posts/2019-08-28-shortcut.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5154ca1">1. Emacs</a>
<ul>
<li><a href="#orgab2dd85">1.1. ORG</a>
<ul>
<li><a href="#org441df4f">1.1.1. Outline</a></li>
</ul>
</li>
<li><a href="#org7f77dfe">1.2. Footnode</a></li>
</ul>
</li>
<li><a href="#orgcd402f7">2. Linux</a></li>
<li><a href="#org9b9c734">3. GIT</a></li>
<li><a href="#org9379134">4. Image</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5154ca1" class="outline-2">
<h2 id="org5154ca1"><span class="section-number-2">1</span> Emacs</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgab2dd85" class="outline-3">
<h3 id="orgab2dd85"><span class="section-number-3">1.1</span> ORG</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org441df4f" class="outline-4">
<h4 id="org441df4f"><span class="section-number-4">1.1.1</span> Outline</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>C-Enter: create same level item</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7f77dfe" class="outline-3">
<h3 id="org7f77dfe"><span class="section-number-3">1.2</span> Footnode</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>C-c C-x f  The footnote action command.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcd402f7" class="outline-2">
<h2 id="orgcd402f7"><span class="section-number-2">2</span> Linux</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Bash history without line numbers</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh"><code><span style="color: #F92672;">history</span> | cut -c 8-</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b9c734" class="outline-2">
<h2 id="org9b9c734"><span class="section-number-2">3</span> GIT</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Remove untracked files from the working tree <code>git clean -f -d</code></li>
<li>Nested GIT <code>git submodule update --init --recursive</code></li>
</ol>
</div>
</div>

<div id="outline-container-org9379134" class="outline-2">
<h2 id="org9379134"><span class="section-number-2">4</span> Image</h2>
<div class="outline-text-2" id="text-4">
<p>
<b>Resize Image</b> First install ImageMagick via:
</p>

<div class="org-src-container">
<pre class="src src-sh"><code>sudo apt-get install imagemagick</code>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><code>convert  -resize 50% source.png dest.jpg</code>
<code>convert -resize 1024X768  source.png dest.jpg</code>
</pre>
</div>
</div>
</div>
